Examinator/src/Enums/ТипыЭлектронныхКурсов/ТипыЭлектронныхКурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлектронныхКурсов</name>
  <enumValues>
    <name>Тест</name>
  </enumValues>
  <enumValues>
    <name>Учебник</name>
  </enumValues>
  <enumValues>
    <name>Слайдовый</name>
  </enumValues>
  <enumValues>
    <name>SCORM</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/CommonModules/ЭлектронноеОбучение/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает значение константы "ИспользоватьЭлектронноеОбучение".
//
// Возвращаемое значение:
//  Булево - значение константы.
//
Функция ИспользоватьЭлектронноеОбучение() Экспорт	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ИспользоватьЭлектронноеОбучение.Получить();	
КонецФункции

// Обновляет значение константы "ИспользоватьЭлектронноеОбучение".
//
// Параметры:
//  Значение - Булево - значение константы.
//
Процедура ОбновитьИспользованиеЭлектронногоОбучения(Знач Значение) Экспорт
	Константы.ИспользоватьЭлектронноеОбучение.Установить(Значение);	
КонецПроцедуры

Процедура ОбработкаПолученияФормыОбъектаЭлектронногоКурса(Параметры, ВыбраннаяФорма, СтандартнаяОбработка) Экспорт
	
	Если Параметры.Свойство("Ключ") И НЕ ПравоДоступа("Изменение", Метаданные.Справочники.ЭлектронныеКурсы) Тогда
		
		СтандартнаяОбработка = Ложь;			
		Параметры.Вставить("ЭлектронныйКурс", Параметры.Ключ);			
		ВыбраннаяФорма = "ОбщаяФорма.ЭлектронныйКурс";			
		Возврат; // Просмотр курса, если нет прав
		
	КонецЕсли;
	
	Если Параметры.Свойство("Ключ") Тогда
		
		ТипЭлектронногоКурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Ключ, "Тип");
		
		Если ТипЭлектронногоКурса = Перечисления.ТипыЭлектронныхКурсов.Слайдовый
			ИЛИ ТипЭлектронногоКурса = Перечисления.ТипыЭлектронныхКурсов.Учебник Тогда
			
			СтандартнаяОбработка = Ложь;				
			Параметры.Вставить("ЭлектронныйКурс", Параметры.Ключ);
			Параметры.Вставить("РежимРедактирования", Истина);				
			ВыбраннаяФорма = "ОбщаяФорма.ЭлектронныйКурс";				
			Возврат; // Редактирование курса	
			
		Иначе
			
			СтандартнаяОбработка = Ложь;
			Параметры.Вставить("ЭлектронныйКурс", Параметры.Ключ);				
			ВыбраннаяФорма = "ОбщаяФорма.ЭлектронныйКурс";								
			Возврат; // Просмотр нередактируемого курса
			
		КонецЕсли;
		
	Иначе
		
		ТипЭлектронногоКурса = Неопределено;
		
		Если Параметры.Свойство("ЗначенияЗаполнения") И Параметры.ЗначенияЗаполнения.Свойство("Тип") Тогда
			ТипЭлектронногоКурса = Параметры.ЗначенияЗаполнения.Тип;
		КонецЕсли;
		
		Если ТипЭлектронногоКурса = Неопределено И Параметры.Свойство("ЗначениеКопирования") Тогда
			ТипЭлектронногоКурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ЗначениеКопирования, "Тип");
		КонецЕсли;			
		
		Если ТипЭлектронногоКурса = Неопределено Тогда
			ТипыКурсов = РазработкаЭлектронныхКурсовСлужебный.ТипыЭлектронныхКурсов();
			Если ТипыКурсов.Количество() > 0 Тогда
				ТипЭлектронногоКурса = ТипыКурсов[0];
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЭлектронногоКурса = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Тип нового электронного курса не задан'");
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;			
		Параметры.Вставить("РежимРедактирования", Истина);
		Параметры.Вставить("ТипЭлектронногоКурса", ТипЭлектронногоКурса);			
		ВыбраннаяФорма = "ОбщаяФорма.ЭлектронныйКурс";			
		Возврат; // Создание курса
		
	КонецЕсли;	
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

#Область НастройкиВариантовОтчетов

// Содержит настройки размещения вариантов отчетов в панели отчетов.
// Описание см. ЗарплатаКадрыВариантыОтчетов.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.ИзучениеЭлектронныхКурсов);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.ОтветыНаТестовыеВопросы);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.РезультатыЭлектронныхТестирований);
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаПодсистемыПечать

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.ИзучениеЭлектронногоКурса);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получает заголовок системы, а если он не задан - синоним метаданных конфигурации.
Функция ИмяЭтойИнформационнойБазы() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Константы.ЗаголовокСистемы.Получить();
	Возврат ?(ПустаяСтрока(Результат), Метаданные.Синоним, Результат);
	
КонецФункции


#КонецОбласти


#КонецОбласти
